#### 链接对象
concat()函数完成了沿轴执行级联操作的所有重要工作

In [4]:
import pandas as pd
one = pd.DataFrame({
    'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayong'],
    'subject_id': ['sub1', 'sub2', 'sub4','sub6','sub5'],
    'Marks_scored':[98,90,87,69,78]},
    index=[1,2,3,4,5])
two = pd.DataFrame({
         'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5'],
         'Marks_scored':[89,80,79,97,88]},
         index=[1,2,3,4,5])
print(one)
print(two)

    Name subject_id  Marks_scored
1   Alex       sub1            98
2    Amy       sub2            90
3  Allen       sub4            87
4  Alice       sub6            69
5  Ayong       sub5            78
    Name subject_id  Marks_scored
1  Billy       sub2            89
2  Brian       sub4            80
3   Bran       sub3            79
4  Bryce       sub6            97
5  Betty       sub5            88

In [3]:
rs = pd.concat([one,two])
rs

    Name subject_id  Marks_scored
1   Alex       sub1            98
2    Amy       sub2            90
3  Allen       sub4            87
4  Alice       sub6            69
5  Ayong       sub5            78
1  Billy       sub2            89
2  Brian       sub4            80
3   Bran       sub3            79
4  Bryce       sub6            97
5  Betty       sub5            88

In [6]:
print(pd.concat([one,two],keys=['x','y']))

      Name subject_id  Marks_scored
x 1   Alex       sub1            98
  2    Amy       sub2            90
  3  Allen       sub4            87
  4  Alice       sub6            69
  5  Ayong       sub5            78
y 1  Billy       sub2            89
  2  Brian       sub4            80
  3   Bran       sub3            79
  4  Bryce       sub6            97
  5  Betty       sub5            88

In [7]:
print(pd.concat([one,two],keys=['x','y'],ignore_index=True))

    Name subject_id  Marks_scored
0   Alex       sub1            98
1    Amy       sub2            90
2  Allen       sub4            87
3  Alice       sub6            69
4  Ayong       sub5            78
5  Billy       sub2            89
6  Brian       sub4            80
7   Bran       sub3            79
8  Bryce       sub6            97
9  Betty       sub5            88